dataset_gen/Earlier_Datasets/OpenFoam/design_points/design_point_2/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9600
(
(-9.67009 -7.45525 0.5)
(-9.42302 -7.45541 0.5)
(-9.17595 -7.45557 0.5)
(-8.92887 -7.45573 0.5)
(-8.68178 -7.45587 0.5)
(-8.43468 -7.45601 0.5)
(-8.18759 -7.45613 0.5)
(-7.94048 -7.45625 0.5)
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(-5.19788 -3.90655 0.5)
(-5.18347 -3.91988 0.5)
(-5.16854 -3.93262 0.5)
(-5.15313 -3.94477 0.5)
(-5.13724 -3.95632 0.5)
(-5.12092 -3.96722 0.5)
(-5.10419 -3.97747 0.5)
(-5.08706 -3.98707 0.5)
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-9.72641 -7.5 0.5)
(-9.47641 -7.5 0.5)
(-9.22641 -7.5 0.5)
(-8.97641 -7.5 0.5)
(-8.72641 -7.5 0.5)
(-8.47641 -7.5 0.5)
(-8.22641 -7.5 0.5)
(-7.97641 -7.5 0.5)
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.023592 7.5 0.5)
(-0.226408 7.5 0.5)
(-0.476408 7.5 0.5)
(-0.726408 7.5 0.5)
(-0.976409 7.5 0.5)
(-1.22641 7.5 0.5)
(-1.47641 7.5 0.5)
(-1.72641 7.5 0.5)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(-15 7.3125 0.5)
(-15 6.9375 0.5)
(-15 6.5625 0.5)
(-15 6.1875 0.5)
(-15 5.8125 0.5)
(-15 5.4375 0.5)
(-15 5.0625 0.5)
(-15 4.6875 0.5)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(15 7.3125 0.5)
(15 6.9375 0.5)
(15 6.5625 0.5)
(15 6.1875 0.5)
(15 5.8125 0.5)
(15 5.4375 0.5)
(15 5.0625 0.5)
(15 4.6875 0.5)
...
)
;
    }
}


// ************************************************************************* //
