dataset_gen/Earlier_Datasets/OpenFoam/design_points/design_point_2/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-7.45525
-7.45541
-7.45557
-7.45573
-7.45587
-7.45601
-7.45613
-7.45625
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-3.90655
-3.91988
-3.93262
-3.94477
-3.95632
-3.96722
-3.97747
-3.98707
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
7.5
7.5
7.5
7.5
7.5
7.5
7.5
7.5
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
7.3125
6.9375
6.5625
6.1875
5.8125
5.4375
5.0625
4.6875
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
7.3125
6.9375
6.5625
6.1875
5.8125
5.4375
5.0625
4.6875
...
)
;
    }
}


// ************************************************************************* //
