dataset_gen/Earlier_Datasets/OpenFoam/design_points/design_point_2/0/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0.5;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0.5;
    }
}


// ************************************************************************* //
